In [1]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    "cars": ["volvo", "BMW" , "Jaguar","TATA","Bugatti"],
    "Year": [12,22,1,19,3]
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

      cars  Year
0    volvo    12
1      BMW    22
2   Jaguar     1
3     TATA    19
4  Bugatti     3

In [8]:
df.to_csv('Car_status.csv')

In [9]:
df.to_csv('Car_status_index_false.csv',index = False)

In [10]:
df.head(2)#default 5

    cars  Year
0  volvo    12
1    BMW    22

In [11]:
df.tail(2)# default 5

      cars  Year
3     TATA    19
4  Bugatti     3

In [12]:
df.describe()

            Year
count   5.000000
mean   11.400000
std     9.343447
min     1.000000
25%     3.000000
50%    12.000000
75%    19.000000
max    22.000000

In [13]:
report = pd.read_csv('weather_data.csv')

In [14]:
report

          day  temperature windspeed   event
0  01/01/2017         32.0         6    Rain
1  01/04/2017          NaN         9   Sunny
2  01/05/2017         28.0       NaN    Snow
3  01/06/2017          NaN         7     NaN
4  01/07/2017         32.0        Na    Rain
5  01/08/2017          NaN       NaN   Sunny
6  01/09/2017          NaN       NaN     NaN
7  01/10/2017         34.0         8  Cloudy
8  01/11/2017         40.0        12   Sunny

In [18]:
report["temperature"]

0    32.0
1     NaN
2    28.0
3     NaN
4    32.0
5     NaN
6     NaN
7    34.0
8    40.0
Name: temperature, dtype: float64

In [19]:
report['temperature'][7]

34.0

In [20]:
report['temperature'][7] = 50

/var/folders/t2/_07492dj083d4y2snbxbp70w0000gn/T/ipykernel_1994/1151003355.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  report['temperature'][7] = 50

In [21]:
report

          day  temperature windspeed   event
0  01/01/2017         32.0         6    Rain
1  01/04/2017          NaN         9   Sunny
2  01/05/2017         28.0       NaN    Snow
3  01/06/2017          NaN         7     NaN
4  01/07/2017         32.0        Na    Rain
5  01/08/2017          NaN       NaN   Sunny
6  01/09/2017          NaN       NaN     NaN
7  01/10/2017         50.0         8  Cloudy
8  01/11/2017         40.0        12   Sunny

In [22]:
report.to_csv("wheater_data.csv") # for changing the data permanentlt

In [23]:
report.index = [1,2,3,4,5,6,7,8,9]

In [24]:
report

          day  temperature windspeed   event
1  01/01/2017         32.0         6    Rain
2  01/04/2017          NaN         9   Sunny
3  01/05/2017         28.0       NaN    Snow
4  01/06/2017          NaN         7     NaN
5  01/07/2017         32.0        Na    Rain
6  01/08/2017          NaN       NaN   Sunny
7  01/09/2017          NaN       NaN     NaN
8  01/10/2017         50.0         8  Cloudy
9  01/11/2017         40.0        12   Sunny